In [87]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [124]:
s0w1d1 = pd.read_csv('../../data/processed/s0w1d1.csv')
s1w0d0 = pd.read_csv('../../data/processed/s1w0d0.csv')
s1w0d1 = pd.read_csv('../../data/processed/s1w0d1.csv')
s1w1d0 = pd.read_csv('../../data/processed/s1w1d0.csv')
s1w1d1 = pd.read_csv('../../data/processed/s1w1d1_1.csv')
wwd = pd.read_csv('../../data/processed/s0w1d0.csv')
oy_df = pd.read_csv('../../data/processed/oy.csv')
no_diploma = pd.read_csv('../../data/processed/OY_group_no_dipl.csv')
diploma = pd.read_csv('../../data/processed/OY_group_HSDGED.csv')
df3 = pd.read_csv('../../data/processed/OY_group_some_college.csv')
df4 = pd.read_csv('../../data/processed/OY_group_degree.csv')

In [89]:
not_oy = [s0w1d1, s1w0d0, s1w0d1, s1w1d0, s1w1d1]

In [90]:
s1w0d0 = s1w0d0.append(pd.Series(), ignore_index=True)

In [91]:
s1w0d0.iloc[8]['count'] = 0

In [92]:
s1w0d0

    age  count
0  16.0  405.0
1  17.0  338.0
2  18.0  117.0
3  19.0   21.0
4  20.0   11.0
5  21.0    4.0
6  22.0    3.0
7  23.0    1.0
8   NaN    0.0

In [93]:
s1w0d1

   age  count
0   16      4
1   17     23
2   18     73
3   19     85
4   20     85
5   21     64
6   22     53
7   23     30
8   24     27

In [94]:
s1w1d0 = s1w1d0.append(pd.Series(), ignore_index=True)
s1w1d0 = s1w1d0.append(pd.Series(), ignore_index=True)
s1w1d0

    age  count
0  16.0   54.0
1  17.0   71.0
2  18.0   46.0
3  19.0    7.0
4  20.0    5.0
5  22.0    2.0
6  23.0    1.0
7   NaN    NaN
8   NaN    NaN

In [95]:
s1w1d0.iloc[7]['count'] = 0
s1w1d0.iloc[8]['count'] = 0
s1w1d0

    age  count
0  16.0   54.0
1  17.0   71.0
2  18.0   46.0
3  19.0    7.0
4  20.0    5.0
5  22.0    2.0
6  23.0    1.0
7   NaN    0.0
8   NaN    0.0

In [96]:
one_zero = pd.DataFrame({'age':[16], 'count':[0]})

s1w1d1_2 = one_zero.append(s1w1d1, ignore_index=True)
s1w1d1_2

   age  count
0   16      0
1   17     11
2   18     60
3   19     86
4   20     90
5   21     70
6   22     76
7   23     53
8   24     47

In [97]:
not_oy_ages = s0w1d1['count'] + s1w0d0['count'] + s1w0d1['count'] + s1w1d0['count'] + s1w1d1_2['count']

In [98]:
type(not_oy_ages)

pandas.core.series.Series

In [99]:
not_oy_ages.sum()

2970.0

In [100]:
not_oy = not_oy_ages
not_oy_index = list(range(16,25))

In [101]:
new_df = pd.DataFrame(data=not_oy_ages, columns=['count'])

In [102]:
new_df['age'] = s1w1d1_2['age']

In [103]:
new_df

   count  age
0  464.0   16
1  444.0   17
2  329.0   18
3  260.0   19
4  314.0   20
5  258.0   21
6  295.0   22
7  291.0   23
8  315.0   24

In [104]:
range_1 = new_df['count'][0:3].sum()
range_2 = new_df['count'][3:6].sum()
range_3 = new_df['count'][6:9].sum()
count_ranges  = np.array([range_1, range_2, range_3])
count_ranges

array([1237.,  832.,  901.])

In [105]:
age_range_1 = '16 - 18'
age_range_2 = '19 - 21'
age_range_3 = '22 - 24'
age_ranges = [age_range_1, age_range_2, age_range_3]
age_ranges

['16 - 18', '19 - 21', '22 - 24']

In [106]:
not_oy_df = pd.DataFrame(data=[count_ranges], columns=['16 - 18', '19 - 21', '22 - 24'])
not_oy_df

   16 - 18  19 - 21  22 - 24
0   1237.0    832.0    901.0

In [107]:
not_oy_df['Total'] = not_oy_df['16 - 18'] + not_oy_df['19 - 21'] + not_oy_df['22 - 24']

In [108]:
not_oy_df

   16 - 18  19 - 21  22 - 24   Total
0   1237.0    832.0    901.0  2970.0

In [109]:
oy_df

   age  count
0   16     15
1   17     10
2   18     35
3   19     49
4   20     47
5   21     50
6   22     62
7   23     63
8   24     60

In [110]:
oy_range_1 = oy_df['count'][0:3].sum()
oy_range_2 = oy_df['count'][3:6].sum()
oy_range_3 = oy_df['count'][6:9].sum()
oy_ranges = [oy_range_1, oy_range_2, oy_range_3]

In [111]:
new_oy_df = pd.DataFrame(data=[oy_ranges], columns=['16 - 18', '19 - 21', '22 - 24'])
new_oy_df['Total'] = new_oy_df['16 - 18'] + new_oy_df['19 - 21'] + new_oy_df['22 - 24'] 
new_oy_df

   16 - 18  19 - 21  22 - 24  Total
0       60      146      185    391

In [112]:
wwd_range_1 = wwd['count'][0:3].sum()
wwd_range_2 = wwd['count'][3:6].sum()
wwd_range_3 = wwd['count'][6:9].sum()
wwd_ranges = [wwd_range_1, wwd_range_2, wwd_range_3]

In [114]:
wwd_df = pd.DataFrame(data=[wwd_ranges], columns=['16 - 18', '19 - 21', '22 - 24'])
wwd_df['Total'] = wwd_df['16 - 18'] + wwd_df['19 - 21'] + wwd_df['22 - 24'] 
wwd_df

   16 - 18  19 - 21  22 - 24  Total
0       16       47       58    121

In [ ]:
df_tp_2017 = new_oy_df

In [ ]:
df_tp_2017.append(wwd_df)

In [115]:
concat = [new_oy_df, wwd_df, not_oy_df]
df_tp_2017 = pd.concat(concat)
df_tp_2017

   16 - 18  19 - 21  22 - 24   Total
0     60.0    146.0    185.0   391.0
0     16.0     47.0     58.0   121.0
0   1237.0    832.0    901.0  2970.0

In [116]:
data_2016_TP = {'' : ['Total Population','Opportunity Youth', 'Working without diploma', 'Not an Opportunity Youth'],
             '(16-18)%': ['100%','6%','1%','93%'],
             '16-18' : [50053,2805,587,46661],
             '(19-21)%': ['100%','17%','5%','78%'],
             '19-21' : [41651,7284,2049,32318],
             '(22-24)%': ['100%','18%','6%','76%'],
             '22-24' : [48031,8728,2877,36426],
             'Total %': ['100%','13%','4%','83%'],
             'Total' : [139735,18817,5513,115405]
            }
data_2016_OY = {'' : ['Opportunity Youth', 'No diploma', 'HS diploma', 'Some college, no degree','Degree (Associate or higher)'],
             '(16-18)%': ['100%','57%','35%','6%','1%'],
             '16-18' : [2805,1610,985,179,31],
             '(19-21)%': ['100%','28%','46%','23%','3%'],
             '19-21' : [7284,2048,3349,1666,221],
             '(22-24)%': ['100%','23%','35%','20%','22%'],
             '22-24' : [8728,1981,3067,1763,1917],
             'Total %': ['100%','30%','39%','19%', '12%'],
             'Total' : [18817,5639,7401,3608,2169]
            }

In [117]:
df_TP = pd.DataFrame(data_2016_TP).set_index('')
df_OY = pd.DataFrame(data_2016_OY).set_index('')

In [118]:
df_TP

,(16-18)%,16-18,(19-21)%,19-21,(22-24)%,22-24,Total %,Total
,,,,,,,,
Total Population,100%,50053,100%,41651,100%,48031,100%,139735
Opportunity Youth,6%,2805,17%,7284,18%,8728,13%,18817
Working without diploma,1%,587,5%,2049,6%,2877,4%,5513
Not an Opportunity Youth,93%,46661,78%,32318,76%,36426,83%,115405

In [135]:
df_tp_2017[''] = ['Opportunity Youth', 'Working without diploma', 'Not an opportunity youth']
df_tp_2017.set_index('')

                          16 - 18  19 - 21  22 - 24   Total

Opportunity Youth            60.0    146.0    185.0   391.0
Working without diploma      16.0     47.0     58.0   121.0
Not an opportunity youth   1237.0    832.0    901.0  2970.0

In [125]:
# adding nil value rows to 'df3' and 'df4' in order to match shapes with the other DFs.
twozero = pd.DataFrame({'agep':[16,17], 'count':[0,0]})
fourzero = pd.DataFrame({'agep':[16,17,18,19], 'count':[0,0,0,0]})
some_college = twozero.append(df3, ignore_index=True)
degree = fourzero.append(df4, ignore_index=True)

In [129]:
# combining the four DFs with a nested merge
df_combo = pd.merge(
                pd.merge(
                    pd.merge(
                        no_diploma, diploma, how='left', left_on='agep', right_on='agep'),
                    some_college, how='left', left_on='agep', right_on='agep'), 
                degree,how='left', left_on='agep', right_on='agep')
df_combo.columns = ['age','no_diploma','diploma_GED','some_college','degree']
df_combo

   age  no_diploma  diploma_GED  some_college  degree
0   16          14            1             0       0
1   17           8            2             0       0
2   18          17           16             2       0
3   19          16           29             4       0
4   20          16           22             7       2
5   21          15           28             5       2
6   22          13           35            12       2
7   23          17           29            10       7
8   24          17           19            16       8

In [134]:
# grouping the age ranges and tidying up the format
df_a = pd.DataFrame(df_combo.iloc[0:3].sum())
df_a['16 to 18'] = pd.DataFrame(df_combo.iloc[0:3].sum())
df_a['19 to 21'] = pd.DataFrame(df_combo.iloc[3:6].sum())
df_a['22 to 24'] = pd.DataFrame(df_combo.iloc[6:9].sum())
df_b = df_a.drop(df_a.columns[0], axis='columns')
df_b['Total'] = df_b['16 to 18']+df_b['19 to 21']+df_b['22 to 24']
df_c = df_b.drop('age')
df_c

              16 to 18  19 to 21  22 to 24  Total
no_diploma          39        47        47    133
diploma_GED         19        79        83    181
some_college         2        16        38     56
degree               0         4        17     21